RationalAsh/gd32f4xx_pac/svd/patched_gd32f4xx.svd
        <register>
          <name>IPA_DPV_RGB565</name>
          <displayName>IPA_DPV_RGB565</displayName>
          <description>Destination pixel value
          register(When the destination pixel format is RGB565)</description>
          <alternateRegister>IPA_DPV_ARGB8888</alternateRegister>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DPDBV</name>
              <description> Destination pre-defined blue value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>DPDGV</name>
              <description> Destination pre-defined green value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>DPDRV</name>
              <description> Destination pre-defined red value</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPA_DPV_ARGB1555</name>
          <displayName>IPA_DPV_ARGB1555</displayName>
          <description>Destination pixel value
          register(When the destination pixel format is ARGB1555)</description>
          <alternateRegister>IPA_DPV_ARGB8888</alternateRegister>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DPDBV</name>
              <description> Destination pre-defined blue value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>DPDGV</name>
              <description> Destination pre-defined green value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>DPDRV</name>
              <description> Destination pre-defined red value</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>DPDAV</name>
              <description> Destination pre-defined alpha value</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPA_DPV_ARGB4444</name>
          <displayName>IPA_DPV_ARGB4444</displayName>
          <description>Destination pixel value
          register(When the destination pixel format is ARGB4444,)</description>
          <alternateRegister>IPA_DPV_ARGB8888</alternateRegister>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DPDBV</name>
              <description> Destination pre-defined blue value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DPDGV</name>
              <description> Destination pre-defined green value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DPDRV</name>
              <description> Destination pre-defined red value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DPDAV</name>
              <description> Destination pre-defined alpha value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPA_DMADDR</name>
          <displayName>IPA_DMADDR</displayName>
          <description>Destination memory base address
          register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMADDR</name>
              <description> Destination memory base address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPA_DLOFF</name>
          <displayName>IPA_DLOFF</displayName>
          <description>Destination line offset
          register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DLOFF</name>
              <description> Destination line offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPA_IMS</name>
          <displayName>IPA_IMS</displayName>
          <description>Image size
          register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WIDTH</name>
              <description> Width of the image to be processed</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>HEIGHT</name>
              <description> Height of the image to be processed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPA_LM</name>
          <displayName>IPA_LM</displayName>
          <description>Line mark
          register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LM</name>
              <description> line mark</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPA_ITCTL</name>
          <displayName>IPA_ITCTL</displayName>
          <description>Inter-timer control
          register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ITEN</name>
              <description> Inter-timer enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>NCCI</name>
              <description>Number of clock cycles interval</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
