RationalAsh/gd32f4xx_pac/svd/patched_gd32f4xx.svd
        <register>
          <name>BDCTL</name>
          <displayName>BDCTL</displayName>
          <description>Backup domain control register
          (RCU_BDCTL)</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LXTALEN</name>
              <description>LXTAL enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LXTALSTB</name>
              <description>External low-speed oscillator stabilization</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LXTALBPS</name>
              <description>LXTAL bypass mode enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LXTALDRI</name>
              <description>LXTAL drive capability</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCSRC</name>
              <description>RTC clock entry selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCEN</name>
              <description>RTC clock enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPRST</name>
              <description>Backup domain reset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSTSCK</name>
          <displayName>RSTSCK</displayName>
          <description>Reset source /clock register
          (RCU_RSTSCK)</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <resetValue>0x0E000000</resetValue>
          <fields>
            <field>
              <name>IRC32KEN</name>
              <description>IRC32K enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRC32KSTB</name>
              <description>IRC32K stabilization</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
             </field>
            <field>
              <name>RSTFC</name>
              <description>Reset flag clear</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BORRSTF</name>
              <description>BOR reset flag</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPRSTF</name>
              <description>External PIN reset flag</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PORRSTF</name>
              <description>Power reset flag</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SWRSTF</name>
              <description>Software reset flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FWDGTRSTF</name>
              <description>Free Watchdog timer reset flag</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WWDGTRSTF</name>
              <description>Window watchdog timer reset flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPRSTF</name>
              <description>Low-power reset flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLSSCTL</name>
          <displayName>PLLSSCTL</displayName>
          <description>PLL clock spread spectrum control register
          (RCU_PLLSSCTL)</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MODCNT</name>
              <description>configure PLL spread spectrum modulation profile amplitude and
frequency</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODSTEP</name>
              <description>configure PLL spread spectrum modulation profile amplitude and
frequency</description>
              <bitOffset>13</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SS_TYPE</name>
              <description>PLL spread spectrum modulation type select</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSCGON</name>
              <description>PLL spread spectrum modulation enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>      
        <register>
          <name>PLLI2S</name>
          <displayName>PLLI2S</displayName>
          <description>PLLI2S register
          (RCU_PLLI2S)</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <resetValue>24003000</resetValue>
          <fields>
            <field>
              <name>PLLI2SPSC</name>
              <description>The PLLI2S VCO source clock prescaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLI2SN</name>
              <description>The PLLI2S VCO clock multi factor</description>
              <bitOffset>6</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
           <field>
              <name>PLLI2SQ</name>
              <description>The PLLI2S Q output frequency division factor from PLLI2S VCO clock</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLI2SR</name>
              <description>The PLLI2S R output frequency division factor from PLLI2S VCO clock</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>      
      <register>
          <name>PLLSAI</name>
          <displayName>PLLSAI</displayName>
          <description>PLLSAI register
          (RCU_PLLSAI)</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <resetValue>24003010</resetValue>
          <fields>
            <field>
              <name>PLLSAIN</name>
              <description>The PLLSAI VCO clock multi factor</description>
              <bitOffset>6</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLSAIP</name>
              <description>The PLLSAI P output frequency division factor from PLLSAI VCO clock</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLSAIQ</name>
              <description>The PLLI2S Q output frequency division factor from PLLI2S VCO clock</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLSAIR</name>
              <description>The PLLSAI R output frequency division factor from PLLSAI VCO clock</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>      
        <register>
          <name>CFG1</name>
          <displayName>CFG1</displayName>
          <description>Clock Configuration register 1</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PLLSAIRDIV</name>
              <description>The divider factor from PLLSAIR clock</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TIMERSEL</name>
              <description>TIMER clock selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDCTL</name>
          <displayName>ADDCTL</displayName>
          <description>Additional clock control register</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CK48MSEL</name>
              <description>48MHz clock selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL48MSEL</name>
              <description>PLL48M clock selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRC48MEN</name>
              <description>Internal 48MHz RC oscillator enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRC48MSTB</name>
              <description>Internal 48MHz RC oscillator clock stabilization Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IRC48MCAL</name>
              <description>Internal 48MHz RC oscillator calibration value register</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

       <register>
          <name>ADDINT</name>
          <displayName>ADDINT</displayName>
          <description>Additional clock interrupt register</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IRC48MSTBIF</name>
              <description>IRC48M stabilization interrupt flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IRC48MSTBIE</name>
              <description>Internal 48 MHz RC oscillator Stabilization Interrupt Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRC48MSTBIC</name>
              <description>Internal 48 MHz RC oscillator Stabilization Interrupt Clear</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>ADDAPB1RST</name>
          <displayName>ADDAPB1RST</displayName>
          <description>APB1 additional reset register</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTCRST</name>
              <description>CTC reset</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IREFRST</name>
              <description>IREF reset</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

      <register>
          <name>ADDAPB1EN</name>
          <displayName>ADDAPB1EN</displayName>
          <description>APB1 additional enable register</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTCEN</name>
              <description>CTC clock enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IREFEN</name>
              <description>IREF interface clock enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      <register>
          <name>ADDAPB1SPEN</name>
          <displayName>ADDAPB1SPEN</displayName>
          <description>APB1 additional sleep mode enable register</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <resetValue>0x88000000</resetValue>
          <fields>
            <field>
              <name>CTCSPEN</name>
              <description>CTC enable  when sleep mode</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IREFSPEN</name>
              <description>IREF enable  when sleep mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>VKEY</name>
          <displayName>VKEY</displayName>
          <description>Voltage key register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY</name>
              <description>The key of RCU_DSV registe</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSV</name>
          <displayName>DSV</displayName>
          <description>Deep sleep mode Voltage register</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DSLPVS</name>
              <description>Deep-sleep mode voltage select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>           
